In [1]:
import os
train_path = '../../raw_train_artifact'

In [3]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns',120)
pd.set_option('display.max_rows',2000)
pd.set_option('precision',5)
pd.set_option('float_format', '{:.5f}'.format)

## User Data

* 900,000 users

In [4]:
user = pd.read_csv(os.path.join(train_path, 'user.csv'))

In [10]:
user.tail(5)

        user_id  age  gender
899995   899996    5       1
899996   899997    3       2
899997   899998    4       2
899998   899999    3       1
899999   900000    3       2

In [7]:
user.groupby('age')['user_id'].count()/user.shape[0]

age
1    0.03911
2    0.16586
3    0.22545
4    0.16731
5    0.14519
6    0.11302
7    0.07412
8    0.03552
9    0.02164
10   0.01279
Name: user_id, dtype: float64

In [14]:
user.groupby('gender')['user_id'].count()/user.shape[0]

gender
1   0.66957
2   0.33043
Name: user_id, dtype: float64

In [28]:
pv = user.pivot_table(index='age', columns='gender', aggfunc='count')
pd.DataFrame(pv.values/np.sum(pv.values, axis=1).reshape((10,1)), columns = ['1', '2'], index = pv.index)

          1       2
age
1   0.64771 0.35229
2   0.65819 0.34181
3   0.66273 0.33727
4   0.69073 0.30927
5   0.69406 0.30594
6   0.68320 0.31680
7   0.65665 0.34335
8   0.63087 0.36913
9   0.61297 0.38703
10  0.60732 0.39268

## Ad Data

In [29]:
ad = pd.read_csv(os.path.join(train_path, 'ad.csv'))

In [31]:
ad.tail(5)

,creative_id,ad_id,product_id,product_category,advertiser_id,industry
2481130,4445714,3812196,9152,3,56976,248
2481131,4445715,3812197,39063,17,427,\N
2481132,4445716,3812198,39063,17,427,\N
2481133,4445717,3812199,35885,17,427,\N
2481134,4445718,3812200,39287,17,427,\N

## Click Log Data

In [32]:
cl = pd.read_csv(os.path.join(train_path,'click_log.csv'))

In [33]:
cl.tail(5)

          time  user_id  creative_id  click_times
30082766     6    30920       228129            1
30082767    57    30920      2361397            1
30082768    26    30920       629802            1
30082769    86    30920      2713031            1
30082770    25    30920       629802            1